Разработка_GZ/src/InformationRegisters/ОтветственныеЛицаОрганизаций/ОтветственныеЛицаОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОтветственныеЛицаОрганизаций</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </resources>
  <resources>
    <name>Должность</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СрокПолномочий</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОтветственноеЛицо</name>
    <type>
      <types>EnumRef.ОтветственныеЛицаОрганизаций</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Разработка_GZ/src/Enums/ЮридическоеФизическоеЛицо/ЮридическоеФизическоеЛицо.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЮридическоеФизическоеЛицо</name>
  <comment>Определяет, является ли организация или контрагент юридическим лицом или нет.</comment>
  <enumValues>
    <name>ЮридическоеЛицо</name>
  </enumValues>
  <enumValues>
    <name>ФизическоеЛицо</name>
  </enumValues>
</mdclass:Enum>

Разработка_GZ/src/Enums/ОтветственныеЛицаОрганизаций/ОтветственныеЛицаОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ОтветственныеЛицаОрганизаций</name>
  <comment>(Регл)</comment>
  <enumValues>
    <name>Руководитель</name>
  </enumValues>
  <enumValues>
    <name>ГлавныйБухгалтер</name>
  </enumValues>
  <enumValues>
    <name>РуководительКадровойСлужбы</name>
  </enumValues>
  <enumValues>
    <name>Кассир</name>
  </enumValues>
  <enumValues>
    <name>ОтветственныйЗаБухгалтерскиеРегистры</name>
  </enumValues>
  <enumValues>
    <name>ОтветственныйЗаНалоговыеРегистры</name>
  </enumValues>
  <enumValues>
    <name>УполномоченныйПредставитель</name>
  </enumValues>
  <enumValues>
    <name>Исполнитель</name>
  </enumValues>
  <enumValues>
    <name>ОтветственныйЗаОформление</name>
  </enumValues>
</mdclass:Enum>

Разработка_GZ/src/Catalogs/ПодразделенияОрганизаций/ПодразделенияОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПодразделенияОрганизаций</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <owners>Catalog.Организации</owners>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РайонныйКоэффициент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбособленноеПодразделение</name>
    <comment>Подразделение является обособленным</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьКодПоОКАТО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГоловнаяОрганизация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Сформировано</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Префикс</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПрефиксБП20</name>
    <comment>Префикс для формирования номера документов (БП 2.0)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦифровойИндексОбособленногоПодразделения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Расформировано</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРасформирования</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РегистрацияВНалоговомОргане</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПоОКПО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСоответствуетСудамЗарегистрированнымВРоссийскомМеждународномРеестреСудов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочиванияИерархического</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПрименяемыйЛьготныйТерриториальныйТариф</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеДляЗаписейОТрудовойДеятельности</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГрафикРаботыСотрудников</name>
    <type>
      <types>DefinedType.ГрафикРаботыСотрудниковПодразделенияОрганизации</types>
    </type>
  </attributes>
  <attributes>
    <name>КодОКВЭД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>8</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеОКВЭД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>254</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмеетНомерТерриториальногоОрганаРосстата</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерТерриториальногоОрганаРосстата</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентСевернойНадбавки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодОрганаФСГС</name>
    <comment>Код территориального органа государственной статистики </comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодОКВЭД2</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>8</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеОКВЭД2</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>254</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РайонныйКоэффициентРФ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СамостоятельнаяКлассификационнаяЕдиница</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <comment> Полное наименование, например, для печати</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Разработка_GZ/src/CommonModules/ОтветственныеЛицаБППереопределяемый/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Ответственные лица: процедуры и функции для работы с ответственным лицами.
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Функция возвращает структуру с реквизитами ответственных лиц.
//
// Параметры:
//  Организация - организация, для которой нужно определить руководящих лиц.
//	ДатаСреза - дата со временем, на которые необходимо определить сведения.
//	Подразделение - подразделение, для которого необходимо определить ответственных лиц.
//
Функция ОтветственныеЛица(Организация, ДатаСреза, Подразделение = Неопределено) Экспорт

	ДанныеОтветственныхЛиц = ОтветственныеЛицаБП.ПустаяСтруктураОтветственныхЛиц();

	Если НЕ ЗначениеЗаполнено(Организация) Тогда
		Возврат ДанныеОтветственныхЛиц;
	КонецЕсли;
	
	СобиратьПоОрганизации = НЕ ЗначениеЗаполнено(Подразделение);

	Если ТипЗнч(Организация) = Тип("СправочникСсылка.Организации") Тогда
		РеквизитыОрганизации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Организация, 
			"ИндивидуальныйПредприниматель, ЮридическоеФизическоеЛицо");
	Иначе
		РеквизитыОрганизации = Новый Структура();
		РеквизитыОрганизации.Вставить("ИндивидуальныйПредприниматель");
		РеквизитыОрганизации.Вставить("ЮридическоеФизическоеЛицо");
	КонецЕсли;

	ЗапросПоЛицам = Новый Запрос();
	ЗапросПоЛицам.УстановитьПараметр("ДатаСреза",   ДатаСреза);
	ЗапросПоЛицам.УстановитьПараметр("Организация", Организация);

	Если РеквизитыОрганизации.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо Тогда
		
		НаименованияОрганизации = Справочники.Организации.НаименованияНаДату(Организация, ДатаСреза);
		
		ФИО = Новый Структура("Фамилия, Имя, Отчество");
		ЗаполнитьЗначенияСвойств(ФИО, НаименованияОрганизации.ФИО);
		ФИО.Вставить("Представление", ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ФИО));
		
		ДанныеОтветственныхЛиц.Руководитель               = РеквизитыОрганизации.ИндивидуальныйПредприниматель;
		ДанныеОтветственныхЛиц.РуководительФИО            = ФИО;
		ДанныеОтветственныхЛиц.РуководительПредставление  = ФИО.Представление;
		
	КонецЕсли;
	
	Если СобиратьПоОрганизации Тогда
	
		ЗапросПоЛицам.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОтветственныеЛицаОрганизацийСрезПоследних.ОтветственноеЛицо,
		|	ОтветственныеЛицаОрганизацийСрезПоследних.ФизическоеЛицо,
		|	ОтветственныеЛицаОрганизацийСрезПоследних.ФизическоеЛицо.Наименование КАК ФизическоеЛицоПредставление,
		|	ОтветственныеЛицаОрганизацийСрезПоследних.Должность,
		|	ОтветственныеЛицаОрганизацийСрезПоследних.Должность.Наименование КАК ДолжностьПредставление
		|ИЗ
		|	РегистрСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(&ДатаСреза, СтруктурнаяЕдиница = &Организация) КАК ОтветственныеЛицаОрганизацийСрезПоследних
		|ГДЕ
		|	ОтветственныеЛицаОрганизацийСрезПоследних.ОтветственноеЛицо <> ЗНАЧЕНИЕ(Перечисление.ОтветственныеЛицаОрганизаций.ПустаяСсылка)";
		
	Иначе // поиск наименьшей структурной единицы, для которой задано ответственное лицо
		
		МассивТиповСтруктурнойЕдиницы = Новый Массив;
		МассивТиповСтруктурнойЕдиницы.Добавить(Тип("СправочникСсылка.Организации"));
		МассивТиповСтруктурнойЕдиницы.Добавить(БухгалтерскийУчетКлиентСерверПереопределяемый.ТипПодразделения());
		
		// Создание таблицы иерархии подразделения.
		ТаблицаСтруктурныхЕдиниц = Новый ТаблицаЗначений;
		ТаблицаСтруктурныхЕдиниц.Колонки.Добавить("Порядок", ОбщегоНазначения.ОписаниеТипаЧисло(15));
		ТаблицаСтруктурныхЕдиниц.Колонки.Добавить("СтруктурнаяЕдиница", Новый ОписаниеТипов(МассивТиповСтруктурнойЕдиницы));

		// Добавление подразделения.
		НоваяСтрока = ТаблицаСтруктурныхЕдиниц.Добавить();
		НоваяСтрока.СтруктурнаяЕдиница = Подразделение;
		
		// Добавление родителей подразделения.
		МассивПодразделений = ОбщегоНазначенияБПВызовСервера.ПолучитьСписокВышеСтоящихГрупп(Подразделение);
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицуИзМассива(ТаблицаСтруктурныхЕдиниц, МассивПодразделений, "СтруктурнаяЕдиница");
		
		// Добавление организации.
		НоваяСтрока = ТаблицаСтруктурныхЕдиниц.Добавить();
		НоваяСтрока.СтруктурнаяЕдиница = Организация;
		
		Порядок = 0;
		Для каждого СтруктурнаяЕдиница Из ТаблицаСтруктурныхЕдиниц Цикл
			Порядок = Порядок + 1;
			СтруктурнаяЕдиница.Порядок = Порядок;
		КонецЦикла; 
		
		ЗапросПоЛицам.УстановитьПараметр("ВнешнийИсточник", ТаблицаСтруктурныхЕдиниц);
		
		// Среди иерархии структурных единиц находим наименьшую, для которой задано ответственное лицо.
		ЗапросПоЛицам.Текст =
		"ВЫБРАТЬ
		|	ВнешнийИсточник.Порядок КАК Порядок,
		|	ВнешнийИсточник.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница
		|ПОМЕСТИТЬ ТаблицаСтруктурныхЕдиниц
		|ИЗ
		|	&ВнешнийИсточник КАК ВнешнийИсточник
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	СтруктурнаяЕдиница
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОтветственныеЛицаОрганизацийСрезПоследних.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	ОтветственныеЛицаОрганизацийСрезПоследних.ОтветственноеЛицо КАК ОтветственноеЛицо,
		|	ОтветственныеЛицаОрганизацийСрезПоследних.ФизическоеЛицо,
		|	ОтветственныеЛицаОрганизацийСрезПоследних.Должность,
		|	ТаблицаСтруктурныхЕдиниц.Порядок КАК Порядок
		|ПОМЕСТИТЬ ОтветственныеЛицаОрганизацийСрезПоследних
		|ИЗ
		|	РегистрСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(&ДатаСреза, ) КАК ОтветственныеЛицаОрганизацийСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаСтруктурныхЕдиниц КАК ТаблицаСтруктурныхЕдиниц
		|		ПО ОтветственныеЛицаОрганизацийСрезПоследних.СтруктурнаяЕдиница = ТаблицаСтруктурныхЕдиниц.СтруктурнаяЕдиница
		|ГДЕ
		|	ОтветственныеЛицаОрганизацийСрезПоследних.ОтветственноеЛицо <> ЗНАЧЕНИЕ(Перечисление.ОтветственныеЛицаОрганизаций.ПустаяСсылка)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ОтветственноеЛицо,
		|	Порядок
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОтветственныеЛицаОрганизацийСрезПоследних.ОтветственноеЛицо КАК ОтветственноеЛицо,
		|	ОтветственныеЛицаОрганизацийСрезПоследних.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	ОтветственныеЛицаОрганизацийСрезПоследних.ФизическоеЛицо,
		|	ОтветственныеЛицаОрганизацийСрезПоследних.ФизическоеЛицо.Наименование КАК ФизическоеЛицоПредставление,
		|	ОтветственныеЛицаОрганизацийСрезПоследних.Должность КАК Должность,
		|	ОтветственныеЛицаОрганизацийСрезПоследних.Должность.Наименование КАК ДолжностьПредставление
		|ИЗ
		|	(ВЫБРАТЬ
		|		ОтветственныеЛицаОрганизацийСрезПоследних.ОтветственноеЛицо КАК ОтветственноеЛицо,
		|		МИНИМУМ(ОтветственныеЛицаОрганизацийСрезПоследних.Порядок) КАК Порядок
		|	ИЗ
		|		ОтветственныеЛицаОрганизацийСрезПоследних КАК ОтветственныеЛицаОрганизацийСрезПоследних
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ОтветственныеЛицаОрганизацийСрезПоследних.ОтветственноеЛицо) КАК ОтветственныеЛица
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОтветственныеЛицаОрганизацийСрезПоследних КАК ОтветственныеЛицаОрганизацийСрезПоследних
		|		ПО ОтветственныеЛица.ОтветственноеЛицо = ОтветственныеЛицаОрганизацийСрезПоследних.ОтветственноеЛицо
		|			И ОтветственныеЛица.Порядок = ОтветственныеЛицаОрганизацийСрезПоследних.Порядок";
		
	КонецЕсли;
	Руководители = ЗапросПоЛицам.Выполнить().Выгрузить();
	
	// Получим ФИО+Представление
	ПоляИмени = "Фамилия, Имя, Отчество, ФамилияИО";
	РуководителиСписок = Руководители.ВыгрузитьКолонку("ФизическоеЛицо");
	УстановитьПривилегированныйРежим(Истина);
	ФИОРуководителей = КадровыйУчет.КадровыеДанныеФизическихЛиц(
		Истина,
		РуководителиСписок,
		ПоляИмени,
		ДатаСреза);
	УстановитьПривилегированныйРежим(Ложь);

	Для каждого Руководитель Из Руководители Цикл
		
		ФИОРуководителя = ФИОРуководителей.Найти(Руководитель.ФизическоеЛицо, "ФизическоеЛицо");
		Если ФИОРуководителя = Неопределено Тогда
			Фамилия       = " ";
			Имя           = " ";
			Отчество      = " ";
			Представление = " ";
		Иначе
			Фамилия       = ФИОРуководителя.Фамилия;
			Имя           = ФИОРуководителя.Имя;
			Отчество      = ФИОРуководителя.Отчество;
			Представление = ФИОРуководителя.ФамилияИО;
		КонецЕсли;
		ФИО = Новый Структура("Фамилия, Имя, Отчество, Представление", Фамилия, Имя, Отчество, Представление);

		ИмяОтветственного = ОбщегоНазначения.ИмяЗначенияПеречисления(Руководитель.ОтветственноеЛицо);
		Если ДанныеОтветственныхЛиц.Свойство(ИмяОтветственного) Тогда
			ДанныеОтветственныхЛиц[ИмяОтветственного]                            = Руководитель.ФизическоеЛицо;
			ДанныеОтветственныхЛиц[ИмяОтветственного + "Должность"]              = Руководитель.Должность;
			ДанныеОтветственныхЛиц[ИмяОтветственного + "ДолжностьПредставление"] = Руководитель.ДолжностьПредставление;
			ДанныеОтветственныхЛиц[ИмяОтветственного + "ФИО"]                    = ФИО;
			ДанныеОтветственныхЛиц[ИмяОтветственного + "Представление"]          = Представление;
		КонецЕсли;

	КонецЦикла;

	Возврат ДанныеОтветственныхЛиц;

КонецФункции

// Функция возвращает массив с датами изменения в ответственных лицах.
//
Функция ДатыИзмененияОтветственныхЛицОрганизаций(Организация) Экспорт

	УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОтветственныеЛицаОрганизаций.Период КАК Период,
	|	ОтветственныеЛицаОрганизаций.ФизическоеЛицо КАК ФизическоеЛицо
	|ИЗ
	|	РегистрСведений.ОтветственныеЛицаОрганизаций КАК ОтветственныеЛицаОрганизаций
	|ГДЕ
	|	ОтветственныеЛицаОрганизаций.СтруктурнаяЕдиница = &Организация
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ОтветственныеЛицаОрганизаций.Период,
	|	ОтветственныеЛицаОрганизаций.ФизическоеЛицо
	|ИЗ
	|	РегистрСведений.ОтветственныеЛицаОрганизаций КАК ОтветственныеЛицаОрганизаций
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПодразделенияОрганизаций КАК ПодразделенияОрганизаций
	|		ПО ОтветственныеЛицаОрганизаций.СтруктурнаяЕдиница = ПодразделенияОрганизаций.Ссылка
	|			И (ПодразделенияОрганизаций.Владелец = &Организация)";
	
	ТаблицаОтветственныеЛица = Запрос.Выполнить().Выгрузить();
	ТаблицаОтветственныеЛица.Индексы.Добавить("ФизическоеЛицо");
	
	МассивДат            = ТаблицаОтветственныеЛица.ВыгрузитьКолонку("Период");
	МассивФизическиеЛица = ТаблицаОтветственныеЛица.ВыгрузитьКолонку("ФизическоеЛицо");
	
	МассивДат            = ОбщегоНазначенияБПВызовСервера.УдалитьПовторяющиесяЭлементыМассива(МассивДат);
	МассивФизическиеЛица = ОбщегоНазначенияБПВызовСервера.УдалитьПовторяющиесяЭлементыМассива(МассивФизическиеЛица);
	
	ТаблицаФизическиеЛица = КадровыйУчет.ПериодыИзмененияФИОФизическихЛиц(МассивФизическиеЛица);
	
	Для каждого СтрокаТаблицыФизическиеЛица Из ТаблицаФизическиеЛица Цикл
		
		ДатыНазначенияОтвественныхЛиц = ТаблицаОтветственныеЛица.НайтиСтроки(Новый Структура("ФизическоеЛицо", СтрокаТаблицыФизическиеЛица.ФизическоеЛицо));
		Для каждого ДатаНазначенияОтветственногоЛица Из ДатыНазначенияОтвественныхЛиц Цикл
			// Добавляем дату изменения ФИО ответственного лица, только если оно произошло после назначения в должность
			Если ДатаНазначенияОтветственногоЛица.Период < СтрокаТаблицыФизическиеЛица.Период 
					И МассивДат.Найти(СтрокаТаблицыФизическиеЛица.Период) = Неопределено Тогда
			
				МассивДат.Добавить(СтрокаТаблицыФизическиеЛица.Период);
				Прервать;
			
			КонецЕсли; 
		
		КонецЦикла; 
	
	КонецЦикла;

	Возврат МассивДат;

КонецФункции

// Функция возвращает структуру с реквизитами подписи уполномоченного лица.
//
// Параметры:
//	Организация 	- СправочникСсылка.Организация
//	ФизическоеЛицо 	- СправочникСсылка.ФизическиеЛица
//	ОснованиеПраваПодписи 	- СправочникСсылка.ОснованияПравПодписи
//	ДатаСреза 		- Дата
//
Функция РеквизитыПодписиУполномоченногоЛица(Организация, ФизическоеЛицо, ОснованиеПраваПодписи = Неопределено,ДатаСреза = Неопределено) Экспорт 
	
	Результат = ОтветственныеЛицаБП.ПустаяСтруктураУполномоченногоЛица();
	
	Если НЕ ЗначениеЗаполнено(ДатаСреза) тогда
		ДатаСреза = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Результат.ФизическоеЛицо        = ФизическоеЛицо;
	Результат.ОснованиеПраваПодписи = ОснованиеПраваПодписи;
	
	Если ЗначениеЗаполнено(ОснованиеПраваПодписи)тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ОснованияПраваПодписи.Наименование КАК ОснованиеПраваПодписиПредставление,
		               |	ОснованияПраваПодписи.Должность,
		               |	ОснованияПраваПодписи.Должность.Наименование КАК ДолжностьПредставление
		               |ИЗ
		               |	Справочник.ОснованияПраваПодписи КАК ОснованияПраваПодписи
		               |ГДЕ
		               |	ОснованияПраваПодписи.Ссылка = &ОснованиеПраваПодписи";
		Запрос.УстановитьПараметр("ОснованиеПраваПодписи", ОснованиеПраваПодписи);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() тогда
			ЗаполнитьЗначенияСвойств(Результат,Выборка);
		КонецЕсли;
		
	КонецЕсли;
	
	Результат.ФИО = Новый Структура("Фамилия, Имя, Отчество, Представление", " ", " ", " ", "");
	
	Если ЗначениеЗаполнено(ФизическоеЛицо) Тогда
		
		ДанныеФизическогоЛица = ОбщегоНазначенияБПВызовСервера.ДанныеФизЛица(Организация, ФизическоеЛицо, ДатаСреза);
		ЗаполнитьЗначенияСвойств(Результат.ФИО, ДанныеФизическогоЛица);
		
		Если НЕ Значениезаполнено(Результат.Должность) тогда
			
			Результат.Должность    = ДанныеФизическогоЛица.Должность;
			
			Если ЗначениеЗаполнено(Результат.Должность) тогда
				Результат.ДолжностьПредставление = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Результат.Должность,"Наименование");
			Иначе
				Результат.ДолжностьПредставление = "";
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Функция возвращает структуру ДанныеУполномоченногоЛица сведения о полномочиях пользователя.
//
// Параметры:
//	Организация 	- СправочникСсылка.Организация
//	Пользователь 	- СправочникСсылка.Пользователи, если не заполнен, то для всех пользователей.
//
Функция ДанныеУполномоченногоЛица(Организация, Пользователь,Подразделение = Неопределено) Экспорт 
	
	Результат = ОтветственныеЛицаБП.ПустаяСтруктураУполномоченныхЛиц();
	
	Если ЗначениеЗаполнено(Подразделение) тогда
		Подразделение = ?(Подразделение.Обособленноеподразделение,Подразделение, Справочники.ПодразделенияОрганизаций.ПустаяСсылка());
	Иначе 
		Подразделение = Справочники.ПодразделенияОрганизаций.ПустаяСсылка();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация",	Организация);
	Запрос.УстановитьПараметр("Подразделение",	Подразделение);
	Запрос.УстановитьПараметр("Пользователь",	Пользователь);
	Запрос.Текст = "ВЫБРАТЬ
	               |	УполномоченныеЛица.УполномоченноеЛицо,
	               |	УполномоченныеЛица.ОснованиеПраваПодписи,
	               |	УполномоченныеЛица.ЗаКогоПодписывает
	               |ИЗ
	               |	РегистрСведений.УполномоченныеЛицаОрганизаций КАК УполномоченныеЛица
	               |ГДЕ
	               |	УполномоченныеЛица.Организация = &Организация
	               |	И УполномоченныеЛица.ПодразделениеОрганизации = &Подразделение
	               |	И УполномоченныеЛица.Пользователь = &Пользователь";
		
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл	
		    Если Выборка.ЗаКогоПодписывает = Перечисления.ОтветственныеЛицаОрганизаций.Руководитель тогда
				
				Результат.Руководитель 			= Выборка.УполномоченноеЛицо;
				Результат.РуководительНаОсновании	= Выборка.ОснованиеПраваПодписи;
								
			ИначеЕсли Выборка.ЗаКогоПодписывает = Перечисления.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер тогда
				
				Результат.ГлавныйБухгалтер 			= Выборка.УполномоченноеЛицо;
				Результат.ГлавныйБухгалтерНаОсновании	= Выборка.ОснованиеПраваПодписи;
				
			ИначеЕсли Выборка.ЗаКогоПодписывает = Перечисления.ОтветственныеЛицаОрганизаций.ОтветственныйЗаОформление тогда
				
				Результат.ОтветственныйЗаОформление 			= Выборка.УполномоченноеЛицо;
				
			КонецЕсли;
		
	КонецЦикла;

	Возврат Результат;

КонецФункции

// Возвращает ответственное лицо на складе на указанную дату.
//
Функция ОтветственноеЛицоНаСкладе(Склад, Дата) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОтветственныеЛицаСрезПоследних.ФизическоеЛицо КАК МОЛ
	|ИЗ
	|	РегистрСведений.ОтветственныеЛица.СрезПоследних(&Дата, СтруктурнаяЕдиница = &Склад) КАК ОтветственныеЛицаСрезПоследних";
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Если Результат.Количество() = 0 Тогда 
		Возврат Справочники.ФизическиеЛица.ПустаяСсылка();
	Иначе
		Возврат Результат[0].МОЛ;
	КонецЕсли;
	
КонецФункции

#КонецОбласти
